[
  {
    "Title": "RJH and MDiG - Protecting Sites from External Noise",
    "Body": "In late 2021, RJH were contracted to construct a noise bund at the recycling centre at RAF Lakenheath, a Royal Air Force station near the village of Lakenheath in Suffolk, United Kingdom. The engineering project is scheduled to be completed over the next 25 years to reduce the noise levels on the recycling centre site that have been generated by the base and the nearby Eriswell Gun Club. The bund is being constructed using 2.2million cubic meters of material, and is currently three years into the construction process.<br/><br/> <h3>Critical work processes</h3><br/>When these bunds are constructed, it is of vital importance that they built in completely level layers, thus ensuring that the bund is accessible to plant machinery all year round. If the layers are not built level, it runs the risk of the structure being compromised and safety issues would arise for the staff working on the site. Building in level layers also ensures that the project remains on schedule and work is completed in a far more efficient manner. To overcome these challenges, RJH contacted MDiG to arrange the rental of their plant machinery fitted with machine control technology from Leica Geosystems. <br><br>Other companies were considered for the tender, but the 12-week lead time made MDiG and Leica Geosystems the best choice to become construction partners to RJH.<br/><br/><h3>Machine control software for your construction site</h3><br/>To support the digitisation of the heavy construction industry, MDiG installed Leica Geosystems MC1 machine control solutions onto their plant machinery. A revolutionising software platform for all machine control solutions and applications, Leica MC1 is the one-for-all software solution platform to guide and automate all heavy construction machines.Comparing the design model to the actual position of the machine's cutting edge, such as the bucket or blade edge, MC1 machine control software assisted the operators from MDiG and RJH to position the machine to achieve the planned design. MC1 software automatically controlled the position of the machine's cutting edge, increasing efficiency for the operators on the construction site.Leica MC1 is carried by the rugged hardware platform, the Leica MCP80 panel and MDS Series docking station, ensuring an interchangeable panel between machines on a job site. <br/><br/>The new MC1 platform is fully integrated into the heavy construction workflow, supported by the cloud-based Leica ConX productivity platform for more efficient management of heavy construction projects. MC1 software simplified the design data handling and is open to all standard design data types, enabling a flexible dataflow to support common workflows on a job site. All machinery on the construction site, as well as Leica Geosystems' field solution iCON site, are now running on the same design data structure, meaning that no data conversion is required. <br/><br/>Furthermore, a seamless data transfer between machines, field units within the job site and office are guaranteed. Consistency in software design throughout all heavy machine control applications reduced training efforts and optimised the learning curve of the operatros. The same software platform is used with different sensor configurations, which improves scalability and training. Furthermore, installers benefited from simplified installation and service processes.",
    "PublishedDate": "10 February 2022",
    "ImagePath": "mdig-and-rjh",
    "ImageDescription": "Mdig vehicle",
    "SourceLink": "https://leica-geosystems.com/en-gb/case-studies/heavy-construction/rjh-and-mdig-protecting-sites-from-external-noise",
    "SourceName": "www.leica-geosystems.com",
    "PageName": "mdig-and-rjh"
  },
  {
    "Title": "New DAF 8x4 'tridem' offers 'unique proposition' for Rory J.Holbrook",
    "Body": "Norfolk-based <a href='/aggregates/aggregate-supply'>Aggregate supply</a> specialist, Rory J.Holbrook, has become the UK's first recipient of DAF Trucks' latest 8x4 rear-steer 'tridem' chassis, after taking delivery of the first two CF 410 FAW sleeper-cabbed trucks from a total order of six units.<br /><br />With rear-steer capability, sleeper-cab, air-suspension, a lightweight 'highway' chassis and Fruehauf's all-new Aggri-Roll (Mk III) non-tipping 'V' body, Rory J.Holbrook describes the new DAF fleet as a 'unique proposition' for road surfacing and associated operations. Trucks are being supplied by the local DAF Dealer in Norwich, Ford & Slater.<br /><br />The first CF 410 FAW is returning immediate productivity benefits for Rory J.Holbrook and its contract with road construction company, Kier Highways. Fruehauf's aluminium construction Aggri-Roll body delivers aggregate via a moving conveyor floor which dispenses material directly to the road surfacing machine. The fixed 'V' body eliminates the inherent problems of using a conventional tipper when in proximity with over-head power lines and road-side trees, thus drastically improving safety and reducing the need for road closures. The 16 cubic-metre hopper discharges just under 20-tonnes of aggregate in under two minutes.<br /><br />New DAF 8x4 'tridem' offers 'unique proposition' for Rory J.Holbrook DAF's innovative 'FAW' axle configuration - the latest addition to DAF's multi-axle range - strikes the optimum balance between on/off road traction and handling agility, combining four-axle payload potential with 6x4 manoeuvrability. A new 10-tonne front axle brings additional loading tolerance across the chassis. The new FAW axle configuration is also available with the XF cab in Space, Super Space and 'Comfort' cab variants and with both MX-11 and MX-13 engines with ratings up to 530hp. The FAW can be specified with the ZF TraXon automated gearbox or the optional Ecosplit 16-speed manual gearbox.<br /><br />New DAF 8x4 'tridem' offers 'unique proposition' for Rory J.Holbrook 'The truck ticks so many boxes for us,' said Managing Director, Rory Holbrook, 'it really is a unique proposition. No other truck manufacturer can offer the combination of a lightweight 'non-construction' chassis on a four-axle tridem set-up, a sleeper cab and air-suspension. After my contact at Kier saw a conveyor floor on one of our trailers, he asked if the methodology would transfer onto an eight-wheel rigid. We sat down with DAF, Ford & Slater and Fruehauf and the answer was 'yes'. The result is a truly no-compromise solution. Apart from the health and safety and productivity benefits,' he said, 'the new truck is a massive hit with the drivers - especially the [TraXon] auto-box and the high-spec CF sleeper cab.'<br /><br />General Manager at Kier Highways, Andy Mayos, added, 'The introduction of the non-tipping DAF with the conveyor floor body for our surface dressing operation has delivered a significantly safer working environment for our workforce. We no longer contend with overhead cables and the associated risks of cable strikes. Also, our clients no longer need to undertake time-consuming overhead cable surveys, and there's no requirement for us to implement 'no tipping zones'. Our operation is wholly more efficient as a result,' he said, 'and we hope that the wider industry adopts this solution as standard practice.'<br /><br />New DAF 8x4 'tridem' offers 'unique proposition' for Rory J.Holbrook Rory J.Holbrook acquired its first 14 DAF CF 8x4 tippers in 2003; the company says a number of which are in 'semi-retirement' yet remain in service still today. The Holbrook fleet now comprises a majority of 40 DAFs from a total of 65 vehicles. Regular Repair & Maintenance is carried out at Rory J.Holbrook's wholly-owned Attleborough Service Centre company.<br /><br />Now in its 32nd year in business, Rory J.Holbrook is based in East Harling in Norfolk with rail-head operations in nearby Norwich and in Brandon, Suffolk, plus a substantial 10-acre recycling centre in Lakenheath, Suffolk.\"",
    "PublishedDate": "24 August 2020",
    "ImagePath": "daf-8x4-news",
    "ImageDescription": "DAF 8x4 Tridem showing huge success of Rory J Holbrook and DAF",
    "SourceLink": "https://www.daf.co.uk/en-gb/news-and-media/news-articles/gb/2020/q3/new-daf-8x4-tridem-offers-unique-proposition-for-rory-j-holbrook",
    "SourceName": "www.daf.co.uk",
    "PageName": "new-daf-8x4"
  },
  {
    "Title": "Sugar sweet success for DC Rail and Rory J.Holbrook",
    "Body": "After a few bumps along the way, independent UK operator DCRail and East Anglian road haulier Rory J Holbrook work together to bring a new bulk flow to the railways. Even though it's a foodstuff that benefits, DCRail and Holbrook are using a terminal better known for aggregates traffic.The partners collaborate to get a key raw material for sugar production - limestone - back on the rails.                        <br /><br />                        By working together, the two independent bulk haulage specialists on rail and road have designed a solution that uses rail haulage from the Peak District in the north of England to Holbrook's depot at Brandon, Suffolk. From here, the material is moved by road the final few miles to the sugar production plants. Rural communities and road networks characterise both areas, so the partners and residents welcome the use of rail.                        <br /><br />                        Plans will see around 6,000 tonnes per week moving by rail, removing the need for over 200 long-distance lorry journeys.                        <br /><br />                        <h3>Beating the road driver shortage</h3>                        <br />'Each year, sugar production requires significant quantities of pure limestone to capture and remove impurities from the rendering of sugar beet', said David Fletcher of DC Rail. '125 kilograms of limestone is used to produce one tonne of sugar. This year it looked like the industry would need to rely on road transport to deliver the essential commodity.'                        <br /><br />                        Thanks to this collaboration, the need for long-distance road transport has been alleviated. Given the current and choric shortage of long-distance truck drivers in the UK, the joint venture cannot have come at a better time. DCRail is already experienced in using both terminals, so they were the apparent rail partner for the venture.                        <br /><br />                        <h3>Rail and road collaboration vital</h3>                        <br />                        DCRail's Fletcher says his company is excited by the prospect of working with all parties to return this traffic to the rails. 'The train planning and material handling maximise the use of assets with each train completing a cycle in 24 hours', he said. 'With powerful Class 60 locomotives and a fleet of new high capacity wagons, each train can carry over 1,800 tonnes of sugar stone. Not only does this mean that customer demand can be satisfied, but it allows rail to compete despite the need for final road delivery. The environment benefits, and Holbrook's fleet can focus on local deliveries that only road can undertake.'                        <br /><br />                        Although it may appear to be a simple solution, there were many challenges to getting sugar stone back on the rails. Fletcher offered a note of thanks to everyone involved in working so hard to get this service operational in just a few weeks. The new traffic builds on the successful reintroduction of rail services to Brandon earlier this year, supplying aggregates for use in the booming East Anglian construction market.",
    "PublishedDate": "05 December 2021",
    "ImagePath": "dc-rail-news",
    "ImageDescription": "Success with DC rail and ongoing relationship thriving",
    "SourceLink": "https://www.daf.co.uk/en-gb/news-and-media/news-articles/gb/2020/q3/new-daf-8x4-tridem-offers-unique-proposition-for-rory-j-holbrook",
    "SourceName": "www.railfreight.com",
    "PageName": "dc-rail-success"
  },
  {
    "Title": "Launch of the UK's first surface dressing innovation",
    "Body": " Kier and Rory J Holbrook Ltd have worked collaboratively to launch a brand-new surface dressing innovation used for the first time in Norfolk. The team is the first in the UK surface dressing industry to introduce this type of truck, which negates the need for the use of tipper trucks. Instead, the new truck uses a conveyor system to dispense aggregate into the Phoenix Chipping machine; meaning that stopping to reload the chipping machine from a tipping truck is no longer needed.                        <br /><br />                        Traditionally, tipper trucks have posed a number of issues for highways teams. In areas with a high density of overhead cables, teams need to leave the area to refill the spreading machine, slowing down the works; the new technology will make the operation 25% more efficient in areas with a high density of overhead obstructions. This means that road repairs will take less time, road closures will be shorter and delays for the travelling public will be reduced.                        <br /><br />                        Surface dressing teams have had issues with tipper trucks striking overhead cables, with some areas having up to 100 cable crossings. When these are struck they cause disruption to the road works and inconvenience to the impacted homeowners and businesses. The truck conveyer belt system means that surface dressing crews can carry out their work without the concern of striking overhead cables.                        <br /><br />                        Andy Mayos at Kier, commented: 'As a company we're committed to working collaboratively with our supply chain and when Rory J Holbrook came to us with this idea, we knew we wanted to work with them to reach the optimum solution.                        <br /><br />                        'Not only will this truck be cost-effective and efficient, it will also provide our employees with a much safer work environment, something we are always striving to do at Kier. Currently, we have 14 trucks in our fleet and we aim to be tipper truck fee by the end of 2020.'                        <br /><br />                        Rory Holbrook commented 'We have worked closely with Kier & Fruehauf to develop this conveyor system with Health and Safety being our number one priority.  The conveyor system is placed onto two types of chassis. A safe construction vehicle for inner city operations with low entry 360 vison cab and a lightweight chassis, both of which has rear wheel steer and air suspension to provide us with a payload of 19.5 tonnes. We are close to completing the articulated version of the conveyor system which will provide us with a pay load of 29.6 tonnes. Not only are these bodies capable of carrying surface dressing stone, being fully insulated, they are the perfect solution to every application.",
    "PublishedDate": "13 November 2018",
    "ImagePath": "kier-surface-dressing-news",
    "ImageDescription": "Uks first surface dressing inoovation by Rory J Holbrook",
    "SourceLink": "https://www.kier.co.uk/media/news-releases/kier-launches-uk-first-surface-dressing-innovation/':~:text=Kier%20and%20Rory%20J%20Holbrook,the%20use%20of%20tipper%20trucks.",
    "SourceName": "www.kier.co.uk",
    "PageName": "surface-dressing-innovation"
  },
  {
    "Title": "UK first for Rory J.Holbrook with new DAF FAWs",
    "Body": "<a href='/aggregates/aggregate-supply'>Aggregate supply</a> specialist Rory J.Holbrook has taken delivery of two DAF CF 410 FAWs, rendering it the first operator in the UK to adopt the manufacturer's latest 8x4 rear-steer tridem chassis.                        <br /><br />                        The firm has four more units on order and all six are kitted out with rear-steer capability, sleeper cabs, air-suspension, lightweight highway chassis and Fruehauf's Aggri-Roll Mk III non-tipping V body, which dispenses aggregate via a conveyor floor to distribute loads directly to the road surfacing machine.                        <br /><br />                        The trucks are being supplied by Ford & Slater of Norwich and the inaugural pair has been deployed for the operator's contract with road construction company, Kier Highways.                        <br /><br />                        DAF claims the fixed V-shaped body is safter than traditional tippers when the vehicle is close to power lines, trees and other overhead road furniture, while the 16 cubic-metre hopper can allegedly pump out almost 20-tonnes of aggregate in less than two minutes.                        <br /><br />                        The FAW is the latest of the manufacturer's multi-axle models, has a 10-tonne front axle and is said to mix four-axle payload potential with 6x4 manoeuvrability.                        <br /><br />                        'After my contact at Kier saw a conveyor floor on one of our trailers, he asked if the methodology would transfer onto an eight-wheel rigid' said managing director, Rory Holbrook, 'we sat down with DAF, Ford & Slater and Fruehauf and the answer was 'yes'. Apart from the health and safety and productivity benefits, the new truck is a massive hit with the drivers - especially the [TraXon] auto-box and the high-spec CF sleeper cab.'                        <br /><br />                        'The introduction of the non-tipping DAF with the conveyor floor body for our surface dressing operation has delivered a significantly safer working environment said Kier Highways general manager Andy Mayos, 'we no longer contend with overhead cables and the associated risks of cable strikes. Also, our clients no longer need to undertake time-consuming overhead cable surveys, and there's no requirement for us to implement 'no tipping zones'.'",
    "PublishedDate": "04 September 2020",
    "ImagePath": "daf-faw-news",
    "ImageDescription": "Aggregate supplier RJH with new DAF FAWs",
    "SourceLink": "https://www.commercialmotor.com/news/product/uk-first-rory-jholbrook-new-daf-faws",
    "SourceName": "www.commercialmotor.com",
    "PageName": "uk-first-for-rjh"
  }
]
